//package com.fan.extractor
//
//
//fun main() {
//    println(
//        DefaultAccountingFirmNameExtractor.extractAccountingFirmName(
//            """
//证券代码：002079        证券简称：苏州固锝        公告编号：2024-010
//          苏州固锝电子股份有限公司
//
// 关于续聘立信会计师事务所（特殊普通合伙）担任
//            2024年度审计机构的公告
//
//    本公司及董事会全体成员保证信息披露的内容真实、准确、完整，没有虚假记载、误导性陈述或重大遗漏。
//
//    苏州固锝电子股份有限公司（以下简称“公司”）于 2024 年 3 月 28 日召开
//第八届董事会第三次会议和第八届监事会第三次会议审议通过了《关于续聘立信会计师事务所（特殊普通合伙）担任 2024 年度审计机构的议案》。本议案尚须提交公司 2023 年年度股东大会审议，现将有关事项公告如下：
//一、拟续聘会计师事务所的情况说明
//
//    立信会计师事务所（特殊普通合伙）（以下简称“立信”）具备从事证券、期货相关业务资格，具有丰富的上市公司审计工作经验，已连续多年为公司提供审计服务。在过去的审计服务中，立信严格遵循相关法律、法规和政策，遵照独立、客观、公正的执业准则，按进度完成了公司各项审计工作，其出具的各项报告能够客观、公正、公允地反映公司财务情况和经营结果，较好地履行了审计机构职责，从专业角度维护了公司及股东的合法权益。为保持审计工作的连续性，经公司董事会审计委员会审议，提议续聘立信为公司 2024 年度的审计机构，负责公司 2024 年度的审计工作，审计费用拟授权公司管理层与立信根据市场行情商定。二、拟续聘会计师事务所的基本信息
//
//
//
//    1、基本信息
//
//    立信会计师事务所（特殊普通合伙）由我国会计泰斗潘序伦博士于 1927 年
//在上海创建，1986 年复办，2010 年成为全国首家完成改制的特殊普通合伙制会
//计师事务所，注册地址为上海市,首席合伙人为朱建弟先生。立信是国际会计网络 BDO 的成员所，长期从事证券服务业务，新证券法实施前具有证券、期货业务许可证，具有 H 股审计资格，并已向美国公众公司会计监督委员会（PCAOB）注册登记。
//
//    2、人员信息
//
//    截至 2023 年末，立信拥有合伙人 278 名、注册会计师 2,533 名、从业人员
//总数 10,730 名，签署过证券服务业务审计报告的注册会计师 693 名。
//
//    3、业务规模
//
//    立信 2023 年业务收入（未经审计）46.14 亿元，其中审计业务收入 34.08
//亿元，证券业务收入 15.16 亿元。2023 年度立信为 671 家上市公司提供年报审
//计服务，审计收费 8.17 亿元。
//
//    4、投资者保护能力
//
//    截至 2023 年末，立信已提取职业风险基金 1.61 亿元，购买的职业保险累计
//赔偿限额为 12.50 亿元，相关职业保险能够覆盖因审计失败导致的民事赔偿责任。
//    近三年在执业行为相关民事诉讼中承担民事责任的情况：
//
//起诉（仲 被诉（被仲裁） 诉讼（仲裁） 诉讼（仲    诉讼（仲裁）结果
//
// 裁）人        人          事件    裁）金额
//
//                                    尚余
//
//        金亚科技、周              1,000 多  连带责任，立信投保的职业
// 投资者  旭辉、立信    2014 年报  万，在诉 保险足以覆盖赔偿金额，目
//                                    讼过程  前生效判决均已履行
//
//        """.trimIndent()
//        )
//    )
//}