//package com.fan.extractor
//
//
//fun main() {
//    println(
//        DefaultAccountingFirmNameExtractor.extractAccountingFirmName(
//            """
//   中国电信股份有限公司董事会审核委员会 关于续聘 2024 年度会计师事务所的 审核意见 中国电信股份有限公司（以下简称“公司”）董事会审核委员会对罗兵咸永道会计师事务所（以下简称“罗兵咸永道”）和普华永道中天会计师事务所（特殊普通合伙）（以下简称“普华永道中天”）的基本情况、执业资质相关证明文件、业务规模、人员信息、专业胜任能力、投资者保护能力、独立性和诚信状况等进行了充分了解和审查，并对 2023 年的审计工作进行了评估，认为普华永道中天和罗兵咸永道具备相关业务审计从业资格，能够满足公司审计工作需求，其在对公司 2023 年度财务报告进行审计的过程中，严格遵照相关审计准则的规定，履行了必要的审计程序，收集了适当、充分的审计证据，审计结论符合公司的实际情况。公司拟续聘该事务所不存在损害公司、股东特别是中小股东的合法权益的情形。公司因此计划续聘普华永道中天和罗兵咸永道，公司董事会审核委员会同意本议案。 中国电信股份有限公司 审核委员会 2024 年 3 月 25 日
//        """.trimIndent()
//        )
//    )
//}